Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry.InvalidGeometrySectionIndex Field
 An invalid geometry section index.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const int InvalidGeometrySectionIndex = -1
Public Const InvalidGeometrySectionIndex As Integer = -1
Field Value
Type: Int32
See Also
Reference
ConnectiveGeometry Class
Tekla.Structures.Model Namespace